# read design
read_verilog ../../rtl/asr8/asr8.v

# generic synthesis
synth -top asr8

# mapping to osu05_stdcells.lib
dfflibmap -liberty osu05_stdcells.lib
abc -liberty osu05_stdcells.lib
clean

# write synthesized design
write_verilog synth.v
