# read design
read_verilog ../rtl/mips.v

# generic synthesis
synth -top mips

# mapping to osu05_stdcells.lib
dfflibmap -liberty osu018_stdcells.lib
abc -liberty osu018_stdcells.lib
clean

# write synthesized design
write_verilog synth.v
