# read design
read_verilog ../rtl/top.v ../rtl/spi.v ../rtl/mult.v

# generic synthesis
synth -top top

# mapping to osu05_stdcells.lib
dfflibmap -liberty osu05_stdcells.lib
abc -liberty osu05_stdcells.lib
clean

# write synthesized design
write_verilog synth.v
